#include <iostream>
int main()
{
    setlocale(LC_ALL, "");
    using namespace std;
    int q, w, e;
    char r;

    //1.1 Пользователь вводит значение, вывести это значение умноженное на 2

    //cout << "Введите значение\n";
    //cin >> q;
    //cout << q << "*2=" << q * 2;


    //1.2 Пользователь вводит 2 значения, вывести их сумму

    //cout << "Введите 1-е значение\n";
    //cin >> q;
    //cout << "Введите 2-е значение\n";
    //cin >> w;
    //cout << q << "+" << w << "=" << q + w;


    //1.3 Пользователь вводит 3 значения, вывести их произведение

    //cout << "Введите 1-е значение\n";
    //cin >> q;
    //cout << "Введите 2-е значение\n";
    //cin >> w;
    //cout << "Введите 3-е значение\n";
    //cin >> e;
    //cout << q << "*" << w << "*" << e << "=" << q * w * e;



    //2.1 Пользователь вводит значение, вывести это же значение в квадрате

    //cout << "Введите значение\n";
    //cin >> q;
    //cout << q << "*" << q << "=" << q * q;


    //2.2 Пользователь вводит 2 значения, вывестиудвоеную сумму данных значений

    //cout << "Введите 1-е значение\n";
    //cin >> q;
    //cout << "Введите 2-е значение\n";
    //cin >> w;
    //cout << "2*(" << q << "+" << w << ")=" << 2 * (q + w);


    //2.3 Пользователь вводит 3 значения, вывести призведение 3-го значения на сумму первых 2-х значений

    //cout << "Введите 1-е значение\n";
    //cin >> q;
    //cout << "Введите 2-е значение\n";
    //cin >> w;
    //cout << "Введите 3-е значение\n";
    //cin >> e;
    //cout << e << "*(" << q << "+" << w << ")=" << e * (q + w);



    //3.1 Пользователь вводит значение, проверить введенное значение больше 10 или нет

    /*cout << "Введите значение\n";
    cin >> q;
    if (q > 10)
        cout << "Введенное значение больше 10";
    else
        cout << "Введенное значение меньше или равно 10";*/


    //3.2 Пользователь вводит 2 значения, проверить равны ли введенные значения

    //cout << "Введите 1-е значение\n";
    //cin >> q;
    //cout << "Введите 2-е значение\n";
    //cin >> w;
    //if (q = w)
    //    cout << "Введенные значение равны";
    //else
    //    cout << "Введенные значение не равны";


    //3.3 Пользователь вводит 3 значения, если их сумма больше 99, вывести: сумма данных чисел имеет больше 2-х знаков

    //cout << "Введите 1-е значение\n";
    //cin >> q;
    //cout << "Введите 2-е значение\n";
    //cin >> w;
    //cout << "Введите 3-е значение\n";
    //cin >> e;
    //if (q + w + e > 99)
    //    cout << "сумма данных чисел имеет больше 2-х знаков";
    //else
    //    cout << "сумма данных чисел имеет 2 или меньше знаков";



    //4.1 Пользователь вводит значение, проверить равно ли оно 1, 10, 100

    //cout << "Введите значение\n";
    //cin >> q;
    //if (q  == 1)
    //    cout << "Введенное значение равно 1";
    //else if (q == 10)
    //    cout << "Введенное значение равно 10";
    //else if (q == 100)
    //    cout << "Введенное значение равно 100";
    //else
    //    cout << "Введенное значение не равно ни 1, ни 10, ни 100";


    //4.2 Пользователь вводит 2 значения, проверить 1-е значение больше, меньше или равно второму
    
    //cout << "Введите 1-е значение\n";
    //cin >> q;
    //cout << "Введите 2-е значение\n";
    //cin >> w;
    //if (q == w)
    //    cout << "Введенные значения равны";
    //else if (q < w) 
    //    cout << "Первое значение меньше второго";
    //else if (q > w)
    //    cout << "Первое значение больше второго";


    //4.3 Пользователь вводит 3 значения, найти наибольшее значение

    //cout << "Введите 1-е значение\n";
    //cin >> q;
    //cout << "Введите 2-е значение\n";
    //cin >> w;
    //cout << "Введите 3-е значение\n";
    //cin >> e;
    //if (q < w)
    //    q = w;
    //if (q < e)
    //    q = e;
    //cout << "Наибольшее из введенных чисел: " << q;



    //5.1 Пользователь вводит значение, проверить делится ли введенное значение нацело на 2, 3, 5

    //cout << "Введите значение\n";
    //cin >> q;
    //(q % 2 == 0) ? cout << "Введенное значение делится на 2\n" : cout << "Введенное значение не делится на 2\n";
    //(q % 3 == 0) ? cout << "Введенное значение делится на 3\n" : cout << "Введенное значение не делится на 3\n";
    //(q % 5 == 0) ? cout << "Введенное значение делится на 5\n" : cout << "Введенное значение не делится на 5\n";


    //5.2 Пользователь вводит 2 значения, проверить входит ли цифра 7 в диапозон из этих значений

    //cout << "Введите 1-е значение\n";
    //cin >> q;
    //cout << "Введите 2-е значение\n";
    //cin >> w;
    //if (w > q)
    //    swap(q, w);
    //(q > 7 && w < 7) ? cout << "Введенные значения можно считать диапозоном 7-и" : cout << "Введенные значения нельзя считать диапозоном 7-и";



    //5.3 Пользователь вводит 3 значения, вывести их по убыванию

    //cout << "Введите 1-е значение\n";
    //cin >> q;
    //cout << "Введите 2-е значение\n";
    //cin >> w;
    //cout << "Введите 3-е значение\n";
    //cin >> e;
    //(q > w&& q > e) ? cout << q << " " : (w > e) ? cout << w << " " : cout << e << " ";;
    //(q > w&& q < e || q < w&& q > e) ? cout << q << " " : (w > q && w < e || w < q&& w > e) ? cout << w << " " : cout << e << " ";;
    //(q < w&& q < e) ? cout << q : (w < e) ? cout << w: cout << e;;



    //6.1 Пользователь вводит цифру, вывести название этой цифры

    //cout << "Введите значение\n";
    //cin >> r;
    //switch (r) {
    //case '0':
    //    cout << "Ноль";
    //    break;
    //case '1':
    //    cout << "Один";
    //    break;
    //case '2':
    //    cout << "Два";
    //    break;
    //case '3':
    //    cout << "Три";
    //    break;
    //case '4':
    //    cout << "Четыре";
    //    break;
    //case '5':
    //    cout << "Пять";
    //    break;
    //case '6':
    //    cout << "Шесть";
    //    break;
    //case '7':
    //    cout << "Семь";
    //    break;
    //case '8':
    //    cout << "Восемь";
    //    break;
    //case '9':
    //    cout << "Девять";
    //    break;
    //default:
    //    cout << "Введенные данные не корректны";
    //}

    
    //6.2 Пользователь вводит 2 значения, вывести является ли 1-е или 2-е значение цифрой или числом
    
    cout << "Введите 1-е значение\n";
    cin >> q;
    cout << "Введите 2-е значение\n";
    cin >> w;
    switch (q) {
    case 0:
        cout << "Цифра\n";
        break;
    case 1:
        cout << "Цифра\n";
        break;
    case 2:
        cout << "Цифра\n";
        break;
    case 3:
        cout << "Цифра\n";
        break;
    case 4:
        cout << "Цифра\n";
        break;
    case 5:
        cout << "Цифра\n";
        break;
    case 6:
        cout << "Цифра\n";
        break;
    case 7:
        cout << "Цифра\n";
        break;
    case 8:
        cout << "Цифра\n";
        break;
    case 9:
        cout << "Цифра\n";
        break;
    default:
        cout << "Число\n";
    }
    switch (w) {
    case 0:
        cout << "Цифра\n";
        break;
    case 1:
        cout << "Цифра\n";
        break;
    case 2:
        cout << "Цифра\n";
        break;
    case 3:
        cout << "Цифра\n";
        break;
    case 4:
        cout << "Цифра\n";
        break;
    case 5:
        cout << "Цифра\n";
        break;
    case 6:
        cout << "Цифра\n";
        break;
    case 7:
        cout << "Цифра\n";
        break;
    case 8:
        cout << "Цифра\n";
        break;
    case 9:
        cout << "Цифра\n";
        break;
    default:
        cout << "Число\n";
    }



    //6.3 Пользователь вводит 3 значения, если 1-е значение равно 7, 2-е значение равно 9, а 3-е значение равно 6

    //cout << "Введите 1-е значение\n";
    //cin >> q;
    //cout << "Введите 2-е значение\n";
    //cin >> w;
    //cout << "Введите 3-е значение\n";
    //cin >> e;
    //switch (q) {
    //case 0:
    //    cout << "Неверно";
    //    break;
    //case 1:
    //    cout << "Неверно";
    //    break;
    //case 2:
    //    cout << "Неверно";
    //    break;
    //case 3:
    //    cout << "Неверно";
    //    break;
    //case 4:
    //    cout << "Неверно";
    //    break;
    //case 5:
    //    cout << "Неверно";
    //    break;
    //case 6:
    //    cout << "Неверно";
    //    break;
    //case 7:
    //    cout << "Верно\n";
    //    switch (w) {
    //    case 0:
    //        cout << "Неверно";
    //        break;
    //    case 1:
    //        cout << "Неверно";
    //        break;
    //    case 2:
    //        cout << "Неверно";
    //        break;
    //    case 3:
    //        cout << "Неверно";
    //        break;
    //    case 4:
    //        cout << "Неверно";
    //        break;
    //    case 5:
    //        cout << "Неверно";
    //        break;
    //    case 6:
    //        cout << "Неверно";
    //        break;
    //    case 7:
    //        cout << "Неверно";
    //        break;
    //    case 8:
    //        cout << "Неверно";
    //        break;
    //    case 9:
    //        cout << "Верно\n";
    //        switch (e) {
    //        case 0:
    //            cout << "Неверно";
    //            break;
    //        case 1:
    //            cout << "Неверно";
    //            break;
    //        case 2:
    //            cout << "Неверно";
    //            break;
    //        case 3:
    //            cout << "Неверно";
    //            break;
    //        case 4:
    //            cout << "Неверно";
    //            break;
    //        case 5:
    //            cout << "Неверно";
    //            break;
    //        case 6:
    //            cout << "Верно\n";
    //            break;
    //        case 7:
    //            cout << "Неверно";
    //            break;
    //        case 8:
    //            cout << "Неверно";
    //            break;
    //        case 9:
    //            cout << "Неверно";
    //            break;
    //        default:
    //            cout << "Введенные данные не корректны";
    //        }
    //        break;
    //    default:
    //        cout << "Введенные данные не корректны";
    //    }
    //    break;
    //case 8:
    //    cout << "Неверно";
    //    break;
    //case 9:
    //    cout << "Неверно";
    //    break;
    //default:
    //    cout << "Введенные данные не корректны";

    //}
}